xl170(broadwell)_not_consolidated_4core_4iothread_2/default/run8.txt
# run=8/10
# 2026-04-07T22:08:32-06:00
# cmd: taskset -c 1-19 sysbench oltp_read_write --mysql-db=sbtest --tables=1 --table_size=100 --threads=32 --time=60 --rand-type=pareto run

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            562072
        write:                           146276
        other:                           75088
        total:                           783436
    transactions:                        34940  (581.95 per sec.)
    queries:                             783436 (13048.64 per sec.)
    ignored errors:                      5208   (86.74 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      581.9486
    time elapsed:                        60.0397s
    total number of events:              34940

Latency (ms):
         min:                                    2.83
         avg:                                   54.97
         max:                                  320.41
         95th percentile:                      116.80
         sum:                              1920592.04

Threads fairness:
    events (avg/stddev):           1091.8750/15.15
    execution time (avg/stddev):   60.0185/0.01